package OD真题;

/**
 * 有M个端口组（1 <= M <=10）个端口组，每个端口组是长度为 N（1 <= N <= 100)的整数数组，如果端口组间存在2个及以上不同端口相同
 * 则认为这两个端口组互相关联，可以合并
 *
 * 第一行输入端口组个数 M ，再输入 M 行，每行逗号隔开，代表端口组，输出合并后的端口组用二维数组表示
 *
 * 输入描述：
 * 端口组内数字可以重复
 * 输出描述：
 * 组内相同端口仅保留一个，从小到大排序。  组外顺序保持输入顺序
 *
 * 示例1：
 *  输入：
 *      4
 *      4
 *      2,3,2
 *      1,2
 *      5
 *  输出：
 *      [[4],[2,3],[1,2],[5]]
 *
 * 示例2：
 *  输入：
 *      3
 *      2,3,1
 *      4,3,2
 *      5
 *  输出：
 *      [[1,2,3,4],[5]]
 *
 * 示例3：
 *  输入：
 *      6
 *      10
 *      4,2,1
 *      9
 *      3,6,9,2
 *      6,3,4
 *      8
 *  输出：
 *      [[10],[1,2,3,4,6,9],[9],[8]]
 *
 * 示例4：
 *  输入：
 *      11
 *  输出：
 *      [[]]                11超出范围，输出[[]]
 *
 * @since 2023-06-07
 */
public class P9关联端口合并 {
    public static void main(String[] args) {

    }
}
